#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/8752a79a-a62f-4a6c-ad40-25338bf23e33/terraform-bin plan -out=tfplan -no-color
module.ecr_pipeline.data.aws_caller_identity.current: Reading...
module.ecr_pipeline.data.aws_partition.current: Reading...
module.ecr_app.data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.ecs_app: Refreshing state... [id=/ecs/aidoctors-app]
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05018c9f2f5eafe4b]
module.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z063915822N0BC5ZKYHSW]
module.s3_alb_logs.data.aws_partition.current: Reading...
aws_cloudwatch_log_group.ecs_datapipeline: Refreshing state... [id=/ecs/aidoctors-datapipeline]
module.ecr_app.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]
module.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]
module.ecr_pipeline.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecr_app.data.aws_caller_identity.current: Read complete after 1s [id=033236469452]
module.s3_alb_logs.data.aws_region.current: Reading...
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]
module.ecr_pipeline.data.aws_caller_identity.current: Read complete after 1s [id=033236469452]
module.ecr_app.data.aws_partition.current: Reading...
module.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]
module.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]
module.ecr_app.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr_app.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr_pipeline.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecr_pipeline.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:cluster/aidoctors-cluster]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]
aws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]
aws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]
aws_ecs_task_definition.pipeline: Refreshing state... [id=aidoctors-pipeline]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04a9210d6e819860d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-032d14adb1303873e]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-052ff9e03f698ca76]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0502dd160b8708725]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d97142a73d67d383]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-01c41d6fc69feb22d]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07986bda8849d0ea6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03666b60bcf3f78c8]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cbf63d01a13e0462]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-04be5e4a51b23c194]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0da33de95c6b30c0e]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03321fcddf6a74d6a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cec7d9e9cd165d57]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0119e203c5ba1a0e1]
module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=1021686302]
module.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1109128757]
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2104895008]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-453735656]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2265517205]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c69eb1f086c8bc1b]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-08d766ec44e726fbb]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-059af2db14f4039a5]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d5f4a3925c0ced23]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cec7d9e9cd165d571080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06100b0df70c7348d]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a08e39f05edda624]
module.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-016b50f675e1c6265]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0eab9fa3eeddf9c1b]
module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bbb0b76584dd1246]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-001aad6eb2f84eccb]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-032d14adb1303873e1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-04a9210d6e819860d1080289494]
module.alb.data.aws_partition.current[0]: Reading...
module.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-2025103116590584470000000a]
module.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251031165905840300000008/50b57d9d22d4a113]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0109020a2ce187eed]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-03178a9b6cf6d516c]
module.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-0438f20217fc0f62b]
module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0c034a063156f97cd]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:loadbalancer/app/aidoctors-alb/c1df99f5c4d6fbfe]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-019097a522275337e]
aws_ecs_service.pipeline: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-pipeline-service]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:listener/app/aidoctors-alb/c1df99f5c4d6fbfe/83e3d8fabb2dd974]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-34QQRRU2QS2LU342HBYZTZ56C4]
module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:033236469452:secret:rds!db-a1871dd0-2a3d-4afb-a054-31bc567abf85-qYjcf5]
aws_route53_record.root: Refreshing state... [id=Z063915822N0BC5ZKYHSW_aidoctors.com_A]
aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-app-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.db.module.db_instance.aws_db_instance.this[0] has changed
  ~ resource "aws_db_instance" "this" {
      + domain_dns_ips                        = []
        id                                    = "db-34QQRRU2QS2LU342HBYZTZ56C4"
        tags                                  = {
            "Name" = "aidoctors-postgres"
        }
        # (73 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] must be replaced
+/- resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      ~ cidr_blocks              = [ # forces replacement
          ~ "10.0.0.0/16" -> "0.0.0.0/0",
        ]
      ~ id                       = "sgrule-2265517205" -> (known after apply)
      ~ security_group_rule_id   = "sgr-06d1263e1505cbe33" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enhanced_monitoring" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "monitoring.rds.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.db.module.db_instance.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be updated in-place
  ~ resource "aws_iam_role" "enhanced_monitoring" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "aidoctors-rds-monitoring-role"
        name                  = "aidoctors-rds-monitoring-role"
        tags                  = {
            "Name" = "aidoctors-postgres"
        }
        # (11 unchanged attributes hidden)
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      ~ id         = "aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.ecr_pipeline.data.aws_caller_identity.current: Reading...%0Amodule.ecr_pipeline.data.aws_partition.current: Reading...%0Amodule.ecr_app.data.aws_caller_identity.current: Reading...%0Aaws_cloudwatch_log_group.ecs_app: Refreshing state... [id=/ecs/aidoctors-app]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05018c9f2f5eafe4b]%0Amodule.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z063915822N0BC5ZKYHSW]%0Amodule.s3_alb_logs.data.aws_partition.current: Reading...%0Aaws_cloudwatch_log_group.ecs_datapipeline: Refreshing state... [id=/ecs/aidoctors-datapipeline]%0Amodule.ecr_app.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]%0Aaws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]%0Amodule.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]%0Amodule.ecr_pipeline.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecr_app.data.aws_caller_identity.current: Read complete after 1s [id=033236469452]%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Read complete after 1s [id=033236469452]%0Amodule.ecr_app.data.aws_partition.current: Reading...%0Amodule.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]%0Amodule.ecr_app.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr_app.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr_pipeline.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecr_pipeline.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:cluster/aidoctors-cluster]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Aaws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]%0Aaws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]%0Aaws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]%0Aaws_ecs_task_definition.pipeline: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04a9210d6e819860d]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-032d14adb1303873e]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-052ff9e03f698ca76]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0502dd160b8708725]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d97142a73d67d383]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-01c41d6fc69feb22d]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07986bda8849d0ea6]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03666b60bcf3f78c8]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cbf63d01a13e0462]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-04be5e4a51b23c194]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0da33de95c6b30c0e]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03321fcddf6a74d6a]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cec7d9e9cd165d57]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0119e203c5ba1a0e1]%0Amodule.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=1021686302]%0Amodule.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1109128757]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2104895008]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-453735656]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2265517205]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c69eb1f086c8bc1b]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-08d766ec44e726fbb]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-059af2db14f4039a5]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d5f4a3925c0ced23]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cec7d9e9cd165d571080289494]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06100b0df70c7348d]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a08e39f05edda624]%0Amodule.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-016b50f675e1c6265]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0eab9fa3eeddf9c1b]%0Amodule.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bbb0b76584dd1246]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-001aad6eb2f84eccb]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-032d14adb1303873e1080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-04a9210d6e819860d1080289494]%0Amodule.alb.data.aws_partition.current[0]: Reading...%0Amodule.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-2025103116590584470000000a]%0Amodule.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251031165905840300000008/50b57d9d22d4a113]%0Amodule.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0109020a2ce187eed]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-03178a9b6cf6d516c]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-0438f20217fc0f62b]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0c034a063156f97cd]%0Amodule.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:loadbalancer/app/aidoctors-alb/c1df99f5c4d6fbfe]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-019097a522275337e]%0Aaws_ecs_service.pipeline: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-pipeline-service]%0Amodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]%0Amodule.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:listener/app/aidoctors-alb/c1df99f5c4d6fbfe/83e3d8fabb2dd974]%0Amodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-34QQRRU2QS2LU342HBYZTZ56C4]%0Amodule.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:033236469452:secret:rds!db-a1871dd0-2a3d-4afb-a054-31bc567abf85-qYjcf5]%0Aaws_route53_record.root: Refreshing state... [id=Z063915822N0BC5ZKYHSW_aidoctors.com_A]%0Aaws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-app-service]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.db.module.db_instance.aws_db_instance.this[0] has changed%0A  ~ resource "aws_db_instance" "this" {%0A      + domain_dns_ips                        = []%0A        id                                    = "db-34QQRRU2QS2LU342HBYZTZ56C4"%0A        tags                                  = {%0A            "Name" = "aidoctors-postgres"%0A        }%0A        # (73 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A+/- create replacement and then destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] must be replaced%0A+/- resource "aws_security_group_rule" "ingress_with_cidr_blocks" {%0A      ~ cidr_blocks              = [ # forces replacement%0A          ~ "10.0.0.0/16" -> "0.0.0.0/0",%0A        ]%0A      ~ id                       = "sgrule-2265517205" -> (known after apply)%0A      ~ security_group_rule_id   = "sgr-06d1263e1505cbe33" -> (known after apply)%0A      + source_security_group_id = (known after apply)%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_iam_policy_document" "enhanced_monitoring" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRole",%0A            ]%0A%0A          + principals {%0A              + identifiers = [%0A                  + "monitoring.rds.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.db.module.db_instance.data.aws_partition.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be updated in-place%0A  ~ resource "aws_iam_role" "enhanced_monitoring" {%0A      ~ assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "monitoring.rds.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        id                    = "aidoctors-rds-monitoring-role"%0A        name                  = "aidoctors-rds-monitoring-role"%0A        tags                  = {%0A            "Name" = "aidoctors-postgres"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] must be replaced%0A-/+ resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {%0A      ~ id         = "aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> (known after apply)%0A      ~ policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*